Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/getting_married/notification_requirements_for_marriage.html.txt.tmx
Source language: en
Languages: ga

source: Notification requirements for marriage
ga: Riachtanais fógartha don phósadh

source: Since the commencement of Part 6 of the Civil Registration Act 2004 in November 2007, anyone notifying a Registrar of their intention to get married in Ireland must give 3 months' notification in person to the Registrar
ga: Ó tháinig Cuid 6 den Acht um Chlárú Sibhialta, 2004 i bhfeidhm i Samhain 2007, ní mór d’aon duine atá tabhairt fógra do Chláraitheoir go bhfuil sé i gceist acu pósadh in Éirinn, fógra 3 mhí a thabhairt go pearsanta don Chláraitheoir

source: This applies to all marriages, whether solemnised by a Registrar or according to religious or secular rites and ceremonies, unless you intend marrying your civil partner and your civil partnership was registered in Ireland
ga: Baineann seo le gach pósadh, bíodh siad sollúnta ag Cláraitheoir nó de réir deasghnátha agus searmanais saolta nó reiligiúnacha, mura mbeartaíonn tú do pháirtnéir sibhialta a phósadh agus má bhí do phósadh sibhialta cláraithe in Éirinn

source: The Registrar does not have to be the Registrar for the district where you live or where you intend getting married
ga: Ní chaithfidh an Cláraitheoir a bheith ina Chláraitheoir don cheantar ina bhfuil cónaí oraibh ná don cheantar ina mbeartaíonn sibh pósadh

source: You need to make an appointment with the Registrar in order to give the notification
ga: Is gá duit coinne a dhéanamh leis an gCláraitheoir d’fhonn an fógra a thabhairt

source: In order to ensure the notification is given at least 3 months before the date you intend getting married on, it is advisable to arrange the appointment well in advance
ga: Lena chinntiú go dtugtar an fógra ar a laghad 3 mhí roimh an dáta a bheartaíonn tú pósadh, moltar duit an choinne a shocrú i bhfad roimh ré

source: A couple in a civil partnership who wish to marry should contact the Registrar who will guide them through the process
ga: Ba cheart do lánúin i bpáirtnéireacht shibhialta ar mian leo pósadh teagmháil a dhéanamh leis an gCláraitheoir a threoróidh iad tríd an bpróiseas

source: If you plan to get married by civil ceremony and a different Registrar will be solemnising the marriage, you must also contact the Registrar's Office for the district you intend getting married in
ga: Má tá sé beartaithe agat pósadh trí shearmanas sibhialta agus má bheidh an pósadh á shollúnú ag Cláraitheoir éagsúil, ní mór duit teagmháil a dhéanamh le hOifig an Chláraitheora don cheantar ina mbeartaíonn tú pósadh

source: A couple getting married are required to give notification in person of their intention to marry to a Registrar at least 3 months before the intended date of the marriage
ga: Ní foláir do lánúin atá ag pósadh fógra pearsanta a thabhairt faoina rún chun pósta chuig Cláraitheoir ar a laghad 3 mhí roimh dháta ceaptha a bpósta

source: The requirement to give a 3-month notice does not apply to civil partners whose civil partnership was registered in Ireland – see 'Civil partners' below
ga: Ní bhíonn feidhm leis an riachtanas chun fógra 3 mhí a thabhairt do pháirtithe sibhialta a cláraíodh an pháirtnéireacht shibhialta in Éirinn – féach 'Páirtithe sibhialta' thíos

source: The notification can be given to any Registrar
ga: Is féidir fógra a thabhairt chuig Cláraitheoir ar bith

source: When you make the appointment with the Registrar you will be informed what information and documents you need to bring with you
ga: Nuair a cheapann tú coinne leis an gCláraitheoir is amhlaidh a chuirfear ar an eolas tú cad iad an fhaisnéis agus na cáipéisí a chaithfidh tú a thabhairt leat

source: As well as bringing original or certified copies of the documents, you also need to bring photocopies of the documents
ga: Chomh maith le bunchóipeanna nó cóipeanna deimhnithe de na cáipéisí a thabhairt leat, caithfidh tú fótachóipeanna de na cáipéisí úd a thabhairt leat freisin

source: In the case of a passport, a good quality, colour photocopy or a passport-sized photo is required
ga: I gcás pas éigin, teastaíonn fótachóip den scoth, ildaite nó grianghraf de mhéid pas

source: If a document is not written in English or Irish, a certified English translation from an independent, verifiable, translation company must be provided
ga: Caithfear aistriúchán Béarla deimhnithe a sholáthar ó chomhlacht aistriúcháin neamhspleách, infhíoraithe mura bhfuil cáipéis éigin scríofa sa Bhéarla ná sa Ghaeilge

source: Generally, you and your intended spouse will each be required to bring the following:
ga: Beidh ort agus ar do chéile ceaptha go hiondúil an méid seo a leanas a thabhairt leo:

source: • Birth Certificate – if not issued by the Civil Registration Service in Ireland it must bear an apostille stamp from the relevant embassy (if possible) or a letter from that embassy attesting the authenticity of the certificate should be supplied
ga: • Teastas Breithe – murab í an tSeirbhís Chlárúcháin Shibhialta in Éirinn a eisíonn é, caithfidh stampa apastaile bheith air ón ambasáid ábhartha (más féidir) nó ba cheart litir a sholáthar ón ambasáid sin mar fhianaise do bharántúlacht an teastais

source: This does not apply to birth certificates issued by Denmark, Italy, France, Belgium or Latvia
ga: Ní bhíonn feidhm leis sin do theastais bhreithe arna n-eisiúint ag an Danmhairg, an Iodáil, an Fhrainc, an Bheilg ná an Laitvia

source: • Original final divorce decrees in respect of all previous divorces if divorced – if it was a foreign divorce contact the Registrar for instruction
ga: • Bun-fhoraithní colscartha deiridh i ndáil le gach colscaradh roimhe sin más duine colscartha tú – déan teagmháil leis an gCláraitheoir i gcomhair treoracha dá mba cholscaradh eachtrach a bhí ann

source: • Original dissolution decrees in respect of all previous civil partnerships if you have a civil partnership dissolution
ga: • Bun-fhoraithní scaoilte i ndáil le gach páirtnéireacht shibhialta roimhe seo má tá scaoileadh páirtnéireachta sibhialta agat

source: • Final decree of nullity and a letter from the relevant court confirming that no appeal was lodged, if you were in a civil partnership or marriage that was annulled by an Irish court
ga: • Foraithne neamhnithe deiridh agus litir ón gcúirt ábhartha lena ndeimhnítear nár taisceadh achomharc ar bith, má bhí tú i bpáirtnéireacht shibhialta nó i bpósadh ar chuir cúirt Éireannach ar neamhní iad

source: • Deceased spouse's death certificate and previous civil marriage certificate if either of you is widowed
ga: • Teastas báis chéile éagtha agus teastas pósta shibhialta roimhe sin má tá ceachtar agaibh in bhur mbaintreach (fir)

source: • Documentary evidence of immigration status if not a citizen of Ireland or an EU member state
ga: • Fianaise fhaisnéiseach de stádas inimirce mura saoránach de chuid na hÉireann ná de bhallstát an AE atá ionat

source: • A Letter of Freedom to Marry or other documentary confirmation of civil status from county of origin if not a citizen of Ireland
ga: • Litir Shaoirse chun Pósta nó deimhniú faisnéiseach eile de stádas sibhialta ón tír bhunaidh mura saoránach d’Éirinn tú

source: You will also have to provide information about the intended marriage such as:
ga: Beidh ort freisin eolas a sholáthar i leith an phósta cheaptha ar nós:

source: • Whether it will be a civil, secular or religious ceremony
ga: • An mbeidh sé ina shearmanas sibhialta, dí-eaglasta nó reiligiúnach

source: • The intended date and location of the marriage
ga: • Dáta agus suíomh ceaptha an phósta

source: • Details of the proposed solemniser of the marriage
ga: • Mionsonraí shollúnóir molta an phósta

source: • The names and dates of birth of the 2 proposed witnesses
ga: • Ainmneacha agus dátaí breithe na beirte finnéithe molta

source: • A PPS number is required for all parties serving notice of intention to marry, who have a current or a future address within the State
ga: • Teastaíonn uimhir PSP i gcomhair gach páirtí a sheirbheálann fógra de rún chun pósta, ag a mbíonn seoladh reatha nó amach anseo sa Stát acu

source: You should download and complete the Data Capture Form (pdf), and bring it with you
ga: Ba cheart duit an Fhoirm Ghabhála Sonraí (pdf) a íoslódáil agus a chomhlánú, agus í a thabhairt leat

source: You will also have to pay a notification fee
ga: Caithfidh tú táille fhógraithe a íoc freisin

source: If you, your intended spouse, the witnesses or the solemniser has a limited knowledge of English, the services of an interpreter is required
ga: Teastaíonn seirbhísí ateangaire má tá cur amach teoranta agatsa, ag do chéilese ceaptha, ag an bhfinné ná ag an sollúnóir ar an mBéarla

source: The interpreter must be from an independent, verifiable translation company and be present for both the notification and the marriage
ga: Caitheann an t-ateangaire teacht ó chomhlacht aistriúcháin neamhspleách infhíoraithe agus bheith i láthair don fhógra agus don phósadh araon

source: When you meet the Registrar you will be required to sign, in the Registrar's presence, a declaration that you know of no lawful impediment to your proposed marriage
ga: Beidh ort dearbhú a shíniú i bhfianaise an Chláraitheora nuair a bhuailfidh tú leis an gCláraitheoir féin, nach eol duit aon chol dlíthiúil do do phósadh molta

source: The Registrar will issue an acknowlegement to both of you and the proposed solemniser of the marriage confirming the date of receipt of notification
ga: Eiseoidh an Cláraitheoir aitheantas daoibh beirt agus do shollúnóir molta an phósta ina ndeimhneofar dáta fála an fhógra

source: This does not give you permission to marry
ga: Ní thugtar cead chun pósta daoibh leis sin

source: Under the Civil Registration Act 2004 (as amended by the Civil Registration (Amendment) Act 2014), the Registrar has the right to investigate and decide whether an intended marriage would be a marriage of convenience for immigration purposes
ga: Tá an ceart ag an gCláraitheoir faoin Acht um Chlárú Sibhialta 2004 (arna leasú ag an Acht um Chlárú Sibhialta (Leasú) 2014), chun imscrúdú agus cinneadh a dhéanamh ar phósadh áisiúlachta chun cuspóirí inimirce é

source: If all the information required has been supplied and there is no impediment to the marriage, the Registrar will issue you with a Marriage Registration Form (see below)
ga: Má soláthraíodh gach eolas riachtanach agus nach ann d’aon chol don phósadh, is amhlaidh a eiseoidh an Cláraitheoir Foirm Chlárúcháin Phósta duit (féach thíos)

source: You can find more information on notification requirements on the Health Service Executive (HSE) website
ga: Is féidir leat níos mó eolais i leith na riachtanas fógraithe a fháil ar láithreán gréasáin Fheidhmeannacht na Seirbhíse Sláinte (FSS)

source: If your civil partnership ceremony took place in the State and you now wish to marry your civil partner, you must, by appointment, attend the Registrar at least 5 days (or as determined by the Registrar) before the intended date of the ceremony to sign a declaration in their presence that there is no impediment to the marriage
ga: Má thit searmanas bhur bpáirtnéireachta sibhialta amach sa Stát agus más mian leat do pháirtnéir sibhialta a phósadh, ní mór duit, trí choinne, cuairt a thabhairt ar an gCláraitheoir ar a laghad 5 lá (nó faoi mar a chinneann an Cláraitheoir) roimh dháta beartaithe an tsearmanais chun dearbhú a shíniú ina láthair nach bhfuil aon bhac ar an bpósadh

source: You pay a reduced fee
ga: Íocann tú táille laghdaithe

source: If your civil partnership ceremony took place abroad you will be required to give the Registrar 3 months’ notice of your intention to marry and complete the standard preliminaries for a valid marriage
ga: Má thit searmanas bhur bpáirtnéireachta sibhialta amach thar lear, beidh ort fógra 3 mhí a thabhairt don Chláraitheoir go bhfuil sé ar intinn agaibh pósadh agus na réamhriachtanais chaighdeánacha le haghaidh pósadh bailí a chomhlánú

source: If either of you are living abroad or are unable to attend a Registration Office due to serious illness, you should contact a Registrar to get permission to make your 3-month notification by post
ga: Má tá ceachtar agaibh ag maireachtáil thar lear, nó mura bhfuil duine agaibh in ann freastal ar Oifig Chláraithe mar gheall ar dhroch-thinneas, ba chóir daoibh teagmháil a dhéanamh le Cláraitheoir chun cead a fháil an fógra 3 mhí a thabhairt sa phost

source: If permission is granted, the Registrar will send you a form which you must complete and return
ga: Má thugtar cead daoibh, seolfaidh an Cláraitheoir foirm chugaibh nach mór daoibh a chomhlánú agus a sheoladh ar ais

source: You will still have to make arrangements to meet the Registrar at least 5 days before you get married in order to make the declaration
ga: Beidh oraibh fós socruithe a dhéanamh chun bualadh leis an gCláraitheoir ar a laghad 5 lá roimh an bpósadh chun an dearbhú a thabhairt

source: This is required before a Marriage Registration Form can be issued
ga: Teastaíonn sé seo sular féidir Foirm Chláraithe Pósta a eisiúint

source: In certain special circumstances, for example, in the case of very serious illness, you may be able to get a Court Exemption Order allowing the marriage to proceed without the 3-month notification
ga: I gcúinsí speisialta ar leith, mar shampla, i gcás tinneas an-tromchúiseach, b'fhéidir go mbeadh ar bhur gcumas Ordú Díolúine Cúirte a fháil a thugann cead don phósadh dul chun cinn gan an fógra trí mhí

source: You should contact either the Circuit Family Court or the High Court in the area in which either of you lives for details on how to proceed
ga: Ba chóir daoibh dul i dteagmháil leis an Cúirt Chuarda Teaghlaigh nó leis an Ard-Chúirt sa cheantar ina bhfuil cónaí ar dhuine agaibh chun sonraí a fháil maidir le conas dul ar aghaidh leis seo

source: This is an informal procedure
ga: Is nós imeachta neamhfhoirmiúil é seo

source: You may apply in person (without hiring a solicitor)
ga: Is féidir libh iarratas a sheoladh isteach (gan aturnae a fháil)

source: There is no court charge for an application for a Court Exemption Order
ga: Níl aon táille cúirte i gceist ar iarratas ar Ordú Díolúine Cúirte

source: However, if you hire a solicitor to represent you, you will have to pay them
ga: Má fhaigheann tú aturnae chun ionadaíocht a dhéanamh ort, beidh ort é/í a íoc

source: The court will require you to show:
ga: Ní mór duit na nithe seo a leanas a léiriú don chúirt:

source: • That there are good reasons for your application
ga: • Go bhfuil cúiseanna maithe le d'iarratas

source: • That the granting of such an Exemption Order is in the best interests of the parties to the intended marriage
ga: • Go bhfuil deonú Ordú Díolúine den sórt seo ar son dea-leasa na bpáirtithe sa phósadh atá beartaithe

source: If you are granted a Court Exemption Order, you still have to make arrangements to meet the Registrar at least 5 days before you get married in order to make the declaration
ga: Má thugtar Ordú Díolúine Cúirte duit, beidh oraibh fós socruithe a dhéanamh chun bualadh leis an gCláraitheoir ar a laghad 5 lá sula bpósann sibh chun an dearbhú a dhéanamh

source: A Marriage Registration Form (MRF) is like a marriage licence
ga: Tá Foirm Chláraithe Pósta (FCP) cosúil le teastas pósta

source: It gives authorisation for a couple to marry and you require one in order to get married in Ireland
ga: Tugann sé údarú do bheirt pósadh agus teastaíonn ceann acu uaibh chun pósadh in Éirinn

source: Providing there is no impediment to the marriage, the Registrar will issue you with an MRF
ga: Chomh fada is nach bhfuil aon bhac ar an bpósadh, eiseoidh an Cláraitheoir FCP daoibh

source: If you bring all the documentation and information required to the meeting with the Registrar, the Registrar may be able to issue the MRF immediately
ga: Má thugann sibh an cháipéisíocht agus an t-eolas riachtanach ar fad libh chuig an gcruinniú leis an gCláraitheoir, b'fhéidir go mbeadh an Cláraitheoir ábalta an FCP a eisiúint láithreach

source: If the marriage does not take place within 6 months of the date of marriage given on the MRF, a new MRF will be required if you still intend to marry
ga: Mura dtarlaíonn an pósadh taobh istigh de 6 mhí ón dáta atá ar an FCP, beidh gá le FCP nua má tá sé fós i gceist agaibh pósadh

source: You will be required to repeat the notification process
ga: Beidh oraibh dul tríd an bpróiseas fógartha arís

source: The standard notification fee is €200
ga: Is é an táille caighdeánach € 200

source: There is a reduced notification fee of €50 for same-sex couples who are already in a civil partnership that is registered in Ireland and now wish to marry
ga: Is ionann an táille laghdaithe le haghaidh páirtnéirí sibhialta ar cláraíodh a bpáirtnéireacht shibhialta in Éirinn agus €50

source: Three months' notification can be given to any Registrar but must be given in person
ga: Is féidir fógra trí mhí a thabhairt do Chláraitheoir ar bith, ach ní mór é a thabhairt go pearsanta

source: Civil partners who do not have to give 3 month's notification must attend the Registrar at least 5 days (or as determined by the Registrar) before the intended date of the ceremony
ga: Ní mór do pháirtnéirí sibhialta nach bhfuil orthu fógra 3 mhí a thabhairt cuairt a thabhairt ar an gCláraitheoir ar a laghad 5 lá (nó faoi mar a chinneann an Cláraitheoir) roimh dháta beartaithe an tsearmanais

source: You can find a list of Registrars offices here. You can book an appointment with a Registrar online at crsappointments.ie
ga: Tá fáil ar liosta Cláraitheoirí ar láithreán gréasáin Oifig an Ard-Chláraitheora

source: Contact details for your local Registrar are also available from your Local Health Office in the HSE
ga: Is féidir leat leabhar coinne a dhéanamh le Cláraitheoir ar líne ag crsappointments.ie
